# KPMG VIRTUAL INTERNSHIP TASK -1¶
### Task - Data Quality Assignment
Sprocket Central Pty Ltd , a medium size bikes & cycling accessories organisation, has approached Tony Smith (Partner) in KPMG’s Lighthouse & Innovation Team. Sprocket Central Pty Ltd is keen to learn more about KPMG’s expertise in its Analytics, Information & Modelling team.

Smith discusses KPMG’s expertise in this space. In particular, he speaks about how the team can effectively analyse the datasets to help Sprocket Central Pty Ltd grow its business.

Primarily, Sprocket Central Pty Ltd needs help with its customer and transactions data. The organisation has a large dataset relating to its customers, but their team is unsure how to effectively analyse it to help optimise its marketing strategy.

However, in order to support the analysis, you speak to the Associate Director for some ideas and she advised that “the importance of optimising the quality of customer datasets cannot be underestimated. The better the quality of the dataset, the better chance you will be able to use it drive company growth.”

please find the 3 datasets attached from Sprocket Central Pty Ltd:

* Customer Demographic
* Customer Addresses
* Transaction data in the past three months
Can you please review the data quality to ensure that it is ready for our analysis in phase two.
#### Now let’s import the necessary Python libraries and the dataset to get started with the task 1

In [1]:
import pandas as pd

In [2]:
Data = pd.ExcelFile("KPMG_VI_New_raw_data_update_final one.xlsx")

In [3]:
#reading of each file seperatly
Transactions=pd.read_excel(Data, 'Transactions')
NewCustomerList=pd.read_excel(Data, 'NewCustomerList')
CustomerDemographic=pd.read_excel(Data, 'CustomerDemographic')
CustomerAddress=pd.read_excel(Data, 'CustomerAddress')

C:\Users\hp\AppData\Local\Temp\ipykernel_14364\2861577310.py:3: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  NewCustomerList=pd.read_excel(Data, 'NewCustomerList')
C:\Users\hp\AppData\Local\Temp\ipykernel_14364\2861577310.py:4: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  CustomerDemographic=pd.read_excel(Data, 'CustomerDemographic')

#### Explore the data: Start by examining the structure and content of the dataset. Use methods like head(), info(), and describe() to get an overview.

* head(): The head() function is used to display the first few rows of a DataFrame or a Series. It provides a quick overview of the dataset, showing the column names and a sample of the data. By default, it displays the first 5 rows, but you can specify a different number of rows to be shown. It helps in quickly inspecting the structure and content of the dataset.

* info(): The info() function provides a concise summary of a DataFrame. It displays information about the column names, data types, non-null values, and memory usage. It is particularly useful for checking the data types of each column, identifying missing or null values, and understanding the overall structure of the dataset. It helps in understanding the data quality and identifying potential issues or inconsistencies.

* describe(): The describe() function generates descriptive statistics of a DataFrame or Series. It provides statistical measures such as count, mean, standard deviation, minimum, maximum, and quartiles for numeric columns. It helps in understanding the distribution and basic statistical properties of the data, detecting outliers, and identifying any data issues or anomalies.

* shape: Returns the dimensions of the dataset (number of rows and columns).

* columns: Returns the column labels of the dataset.

* dtypes: Returns the data types of each column.

* isnull: Returns a boolean mask indicating missing values in the dataset.

* value_counts: Returns the frequency count of unique values in a column.

* unique: Returns the unique values in a column.

* nunique: Returns the number of unique values in each column.

### Transactions Dataset

In [4]:
Transactions.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [5]:
Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [6]:
Transactions.describe

<bound method NDFrame.describe of        transaction_id  product_id  customer_id transaction_date  online_order  \
0                   1           2         2950       2017-02-25           0.0
1                   2           3         3120       2017-05-21           1.0
2                   3          37          402       2017-10-16           0.0
3                   4          88         3135       2017-08-31           0.0
4                   5          78          787       2017-10-01           1.0
...               ...         ...          ...              ...           ...
19995           19996          51         1018       2017-06-24           1.0
19996           19997          41          127       2017-11-09           1.0
19997           19998          87         2284       2017-04-14           1.0
19998           19999           6         2764       2017-07-03           0.0
19999           20000          11         1144       2017-09-22           1.0

      order_status           brand product_line product_class product_size  \
0         Approved           Solex     Standard        medium       medium
1         Approved   Trek Bicycles     Standard        medium        large
2         Approved      OHM Cycles     Standard           low       medium
3         Approved  Norco Bicycles     Standard        medium       medium
4         Approved  Giant Bicycles     Standard        medium        large
...            ...             ...          ...           ...          ...
19995     Approved      OHM Cycles     Standard          high       medium
19996     Approved           Solex         Road        medium       medium
19997     Approved      OHM Cycles     Standard        medium       medium
19998     Approved      OHM Cycles     Standard          high       medium
19999     Approved   Trek Bicycles     Standard        medium        small

       list_price  standard_cost  product_first_sold_date
0           71.49          53.62                  41245.0
1         2091.47         388.92                  41701.0
2         1793.43         248.82                  36361.0
3         1198.46         381.10                  36145.0
4         1765.30         709.48                  42226.0
...           ...            ...                      ...
19995     2005.66        1203.40                  37823.0
19996      416.98         312.74                  35560.0
19997     1636.90          44.71                  40410.0
19998      227.88         136.73                  38216.0
19999     1775.81        1580.47                  36334.0

[20000 rows x 13 columns]>

In [7]:
#using reuireed column
Transactions= Transactions.iloc[:,0:13]
Transactions.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [9]:
Transactions.shape

(20000, 13)

In [10]:
Transactions.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [11]:
Transactions.dtypes

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

In [12]:
Transactions.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In that table there are missing value in 7 column. next remove all missing value.

In [13]:
#duplicate value
Transactions.duplicated().sum()

0

There is no duplicate value present in this data

In [14]:
#unique value of each column
Transactions.nunique()

transaction_id             20000
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                103
product_first_sold_date      100
dtype: int64

### Exploring the columns

In [17]:
Transactions.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [18]:
Transactions['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [19]:
Transactions['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [20]:
Transactions['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [21]:
Transactions['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [22]:
Transactions['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

In [23]:
Transactions['product_first_sold_date'].value_counts()

33879.0    234
41064.0    229
37823.0    227
39880.0    222
38216.0    220
          ...
41848.0    169
42404.0    168
41922.0    166
37659.0    163
34586.0    162
Name: product_first_sold_date, Length: 100, dtype: int64

As we can see that the 'product_first_sold_date' values are in  dtype: int64 so as column name say itself that the values must be datetime format, so now we convert this int to datetime.

In [24]:
#convert integer to datetime
Transactions['product_first_sold_date']=pd.to_datetime(Transactions['product_first_sold_date'], unit='s')

Let's Check once the 'product_first_sold_date' values are converted or not in datetime format

In [25]:
Transactions['product_first_sold_date'].head(10)

0   1970-01-01 11:27:25
1   1970-01-01 11:35:01
2   1970-01-01 10:06:01
3   1970-01-01 10:02:25
4   1970-01-01 11:43:46
5   1970-01-01 10:50:31
6   1970-01-01 09:29:25
7   1970-01-01 11:05:15
8   1970-01-01 09:17:35
9   1970-01-01 10:36:56
Name: product_first_sold_date, dtype: datetime64[ns]

So here Our Transactions dataset data quality Examine is Over . Now we Move towards the next dataset.

### New CustomerList Dataset

In [26]:
NewCustomerList.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.81,1.0125,1.265625,1.075781,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,1.00,1.0000,1.250000,1.062500,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.57,0.5700,0.570000,0.570000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.87,1.0875,1.087500,1.087500,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.41,0.4100,0.512500,0.512500,4,4,1.703125

In [27]:
NewCustomerList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [28]:
NewCustomerList.describe

<bound method NDFrame.describe of     first_name  last_name  gender  past_3_years_bike_related_purchases  \
0      Chickie    Brister    Male                                   86
1        Morly     Genery    Male                                   69
2      Ardelis  Forrester  Female                                   10
3       Lucine      Stutt  Female                                   64
4      Melinda     Hadlee  Female                                   34
..         ...        ...     ...                                  ...
995  Ferdinand  Romanetti    Male                                   60
996       Burk    Wortley    Male                                   22
997   Melloney      Temby  Female                                   17
998     Dickie    Cubbini    Male                                   30
999      Sylas    Duffill    Male                                   56

           DOB                     job_title job_industry_category  \
0   1957-07-12               General Manager         Manufacturing
1   1970-03-22           Structural Engineer              Property
2   1974-08-28        Senior Cost Accountant    Financial Services
3   1979-01-28    Account Representative III         Manufacturing
4   1965-09-21             Financial Analyst    Financial Services
..         ...                           ...                   ...
995 1959-10-07                     Paralegal    Financial Services
996 2001-10-17        Senior Sales Associate                Health
997 1954-10-05  Budget/Accounting Analyst IV    Financial Services
998 1952-12-17             Financial Advisor    Financial Services
999 1955-10-02           Staff Accountant IV              Property

        wealth_segment deceased_indicator owns_car  ...  state    country  \
0        Mass Customer                  N      Yes  ...    QLD  Australia
1        Mass Customer                  N       No  ...    NSW  Australia
2    Affluent Customer                  N       No  ...    VIC  Australia
3    Affluent Customer                  N      Yes  ...    QLD  Australia
4    Affluent Customer                  N       No  ...    NSW  Australia
..                 ...                ...      ...  ...    ...        ...
995  Affluent Customer                  N       No  ...    NSW  Australia
996      Mass Customer                  N       No  ...    NSW  Australia
997  Affluent Customer                  N      Yes  ...    QLD  Australia
998      Mass Customer                  N      Yes  ...    QLD  Australia
999      Mass Customer                  N      Yes  ...    NSW  Australia

     property_valuation Unnamed: 16 Unnamed: 17  Unnamed: 18  Unnamed: 19  \
0                     6        0.81      1.0125     1.265625     1.075781
1                    11        1.00      1.0000     1.250000     1.062500
2                     5        0.57      0.5700     0.570000     0.570000
3                     1        0.87      1.0875     1.087500     1.087500
4                     9        0.41      0.4100     0.512500     0.512500
..                  ...         ...         ...          ...          ...
995                   7        0.74      0.7400     0.740000     0.740000
996                  10        0.74      0.7400     0.925000     0.786250
997                   2        0.92      1.1500     1.150000     1.150000
998                   2        0.65      0.8125     0.812500     0.690625
999                   9        0.65      0.8125     1.015625     0.863281

     Unnamed: 20  Rank     Value
0              1     1  1.718750
1              1     1  1.718750
2              1     1  1.718750
3              4     4  1.703125
4              4     4  1.703125
..           ...   ...       ...
995          996   996  0.374000
996          997   997  0.357000
997          997   997  0.357000
998          997   997  0.357000
999         1000  1000  0.340000

[1000 rows x 23 columns]>

From above examine we can see that their is some Unamed column is present in our dataset. So here i am droping this unnamed column by using drop() function.

In [29]:
#Drop the unnamed column
NewCustomerList.drop(['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20'], axis=1, inplace=True)

In [30]:
NewCustomerList.shape

(1000, 18)

In [31]:
NewCustomerList.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Rank', 'Value'],
      dtype='object')

In [32]:
NewCustomerList.dtypes

first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Rank                                            int64
Value                                         float64
dtype: object

In [33]:
NewCustomerList.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In that table there are missing value in 4 column. next remove all missing value.

In [34]:
NewCustomerList.duplicated().sum()

0

There is no duplicate value present in this data

In [35]:
NewCustomerList.nunique()

first_name                              940
last_name                               961
gender                                    3
past_3_years_bike_related_purchases     100
DOB                                     958
job_title                               184
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        1
owns_car                                  2
tenure                                   23
address                                1000
postcode                                522
state                                     3
country                                   1
property_valuation                       12
Rank                                    324
Value                                   319
dtype: int64

Exploring column

In [36]:
NewCustomerList.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Rank', 'Value'],
      dtype='object')

In [37]:
NewCustomerList['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [38]:
NewCustomerList[NewCustomerList.gender=='U']

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
59,Normy,Goodinge,U,5,NaT,Associate Professor,IT,Mass Customer,N,No,4,7232 Fulton Parkway,3810,VIC,Australia,5,57,1.375000
226,Hatti,Carletti,U,35,NaT,Legal Assistant,IT,Affluent Customer,N,Yes,11,6 Iowa Center,2519,NSW,Australia,9,226,1.112500
324,Rozamond,Turtle,U,69,NaT,Legal Assistant,IT,Mass Customer,N,Yes,3,57025 New Castle Street,3850,VIC,Australia,3,324,1.010000
358,Tamas,Swatman,U,65,NaT,Assistant Media Planner,Entertainment,Affluent Customer,N,No,5,78 Clarendon Drive,4551,QLD,Australia,8,358,0.980000
360,Tracy,Andrejevic,U,71,NaT,Programmer II,IT,Mass Customer,N,Yes,11,5675 Burning Wood Trail,3030,VIC,Australia,7,361,0.977500
374,Agneta,McAmish,U,66,NaT,Structural Analysis Engineer,IT,Mass Customer,N,No,15,5773 Acker Way,4207,QLD,Australia,6,375,0.960000
434,Gregg,Aimeric,U,52,NaT,Internal Auditor,IT,Mass Customer,N,No,7,72423 Surrey Street,3753,VIC,Australia,5,433,0.906250
439,Johna,Bunker,U,93,NaT,Tax Accountant,IT,Mass Customer,N,Yes,14,3686 Waubesa Way,3065,VIC,Australia,6,436,0.903125
574,Harlene,Nono,U,69,NaT,Human Resources Manager,IT,Mass Customer,N,No,12,0307 Namekagon Crossing,2170,NSW,Australia,7,575,0.796875
598,Gerianne,Kaysor,U,15,NaT,Project Manager,IT,Affluent Customer,N,No,5,882 Toban Lane,2121,NSW,Australia,11,599,0.775000
664,Chicky,Sinclar,U,43,NaT,Operator,IT,High Net Worth,N,Yes,0,5 Red Cloud Place,3222,VIC,Australia,4,662,0.711875
751,Adriana,Saundercock,U,20,NaT,Nurse,IT,High Net Worth,N,Yes,14,82 Gina Junction,3806,VIC,Australia,7,751,0.648125
775,Dmitri,Viant,U,62,NaT,Paralegal,Financial Services,Affluent Customer,N,No,5,95960 Warner Parkway,3842,VIC,Australia,1,774,0.626875
835,Porty,Hansed,U,88,NaT,General Manager,IT,Mass Customer,N,No,13,768 Southridge Drive,2112,NSW,Australia,11,832,0.575000
883,Shara,Bramhill,U,24,NaT,NaN,IT,Affluent Customer,N,No,2,01 Bunker Hill Drive,2230,NSW,Australia,10,883,0.531250
904,Roth,Crum,U,0,NaT,Legal Assistant,IT,Mass Customer,N,No,2,276 Anthes Court,2450,NSW,Australia,6,904,0.500000
984,Pauline,Dallosso,U,82,NaT,Desktop Support Technician,IT,Affluent Customer,N,Yes,0,9594 Badeau Street,2050,NSW,Australia,10,985,0.408000

By examine their is 17 unknown and unspecified gender

In [39]:
NewCustomerList['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [40]:
NewCustomerList['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [41]:
NewCustomerList['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [42]:
NewCustomerList['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [43]:
NewCustomerList['deceased_indicator'].value_counts()

N    1000
Name: deceased_indicator, dtype: int64

So here Our New CustomerList Dataset data quality Examine is Over . Now we Move towards the next dataset.

### Customer Demographic Dataset

In [44]:
CustomerDemographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,720,Darrel,Canet,Male,67,1931-10-23,Recruiting Manager,Retail,Affluent Customer,N,1;DROP TABLE users,No,6.0
1,1092,Katlin,Creddon,Female,56,1935-08-22,VP Quality Control,Retail,Mass Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,No,5.0
2,3410,Merrili,Brittin,Female,93,1940-09-22,NaN,Property,Mass Customer,N,á,No,16.0
3,2413,Abbey,Murrow,Male,27,1943-08-11,Environmental Specialist,Manufacturing,High Net Worth,N,á,Yes,17.0
4,658,Donn,Bonnell,Male,38,1944-01-24,Tax Accountant,Manufacturing,Affluent Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,Yes,8.0

In [45]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [46]:
CustomerDemographic.describe

<bound method NDFrame.describe of       customer_id first_name  last_name  gender  \
0             720     Darrel      Canet    Male
1            1092     Katlin    Creddon  Female
2            3410    Merrili    Brittin  Female
3            2413      Abbey     Murrow    Male
4             658       Donn    Bonnell    Male
...           ...        ...        ...     ...
3995         3779      Ulick     Daspar       U
3996         3883      Nissa     Conrad       U
3997         3931      Kylie      Epine       U
3998         3935     Teodor  Alfonsini       U
3999         3998     Sarene    Woolley       U

      past_3_years_bike_related_purchases        DOB  \
0                                      67 1931-10-23
1                                      56 1935-08-22
2                                      93 1940-09-22
3                                      27 1943-08-11
4                                      38 1944-01-24
...                                   ...        ...
3995                                   68        NaT
3996                                   35        NaT
3997                                   19        NaT
3998                                   72        NaT
3999                                   60        NaT

                     job_title job_industry_category     wealth_segment  \
0           Recruiting Manager                Retail  Affluent Customer
1           VP Quality Control                Retail      Mass Customer
2                          NaN              Property      Mass Customer
3     Environmental Specialist         Manufacturing     High Net Worth
4               Tax Accountant         Manufacturing  Affluent Customer
...                        ...                   ...                ...
3995                       NaN                    IT  Affluent Customer
3996           Legal Assistant                    IT      Mass Customer
3997                       NaN                    IT     High Net Worth
3998                       NaN                    IT     High Net Worth
3999         Assistant Manager                    IT     High Net Worth

     deceased_indicator             default owns_car  tenure
0                     N  1;DROP TABLE users       No     6.0
1                     N  ì¬íê³¼íì ì´íì°êµ¬ì       No     5.0
2                     N                   á       No    16.0
3                     N                  á       Yes    17.0
4                     N  ì¬íê³¼íì ì´íì°êµ¬ì      Yes     8.0
...                 ...                 ...      ...     ...
3995                  N                 NaN       No     NaN
3996                  N                 NaN       No     NaN
3997                  N                 NaN      Yes     NaN
3998                  N                 NaN      Yes     NaN
3999                  N                 NaN       No     NaN

[4000 rows x 13 columns]>

In [48]:
CustomerDemographic.shape

(4000, 13)

In [50]:
CustomerDemographic.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [51]:
CustomerDemographic.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
default                                        object
owns_car                                       object
tenure                                        float64
dtype: object

In [47]:
CustomerDemographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In that table there are missing value in 6 column. next remove all missing value.

In [52]:
CustomerDemographic.duplicated().sum()

0

There is no duplicate value present in this data

In [53]:
#unique value
CustomerDemographic.nunique()

customer_id                            4000
first_name                             3139
last_name                              3725
gender                                    6
past_3_years_bike_related_purchases     100
DOB                                    3448
job_title                               195
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        2
default                                  90
owns_car                                  2
tenure                                   22
dtype: int64

Exploring cloumns

In [54]:
CustomerDemographic.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [55]:
CustomerDemographic['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In that gender column their are some incorrect title. so then rename all

In [57]:
CustomerDemographic['gender']=CustomerDemographic['gender'].replace('F','Female').replace('Femal','Female').replace('M','Male')

In [58]:
CustomerDemographic['gender'].value_counts()

Female    2039
Male      1873
U           88
Name: gender, dtype: int64

In [59]:
CustomerDemographic['past_3_years_bike_related_purchases'].value_counts()

16    56
19    56
67    54
20    54
2     50
      ..
8     28
86    27
85    27
95    27
92    24
Name: past_3_years_bike_related_purchases, Length: 100, dtype: int64

In [60]:
CustomerDemographic['DOB'].value_counts()

1978-01-30    7
1978-08-19    4
1976-09-25    4
1976-07-16    4
1962-12-17    4
             ..
1972-07-11    1
1972-07-17    1
1972-07-26    1
1972-07-30    1
1843-12-21    1
Name: DOB, Length: 3448, dtype: int64

In [61]:
CustomerDemographic['job_title'].value_counts()

Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Human Resources Assistant IV             4
Research Assistant III                   3
Health Coach I                           3
Health Coach III                         3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [62]:
CustomerDemographic['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [63]:
CustomerDemographic['wealth_segment'].value_counts()

Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64

In [64]:

CustomerDemographic['deceased_indicator'].value_counts()

N    3998
Y       2
Name: deceased_indicator, dtype: int64

In [65]:
CustomerDemographic['default'].value_counts()

100                                       113
1                                         112
-1                                        111
-100                                       99
Ù¡Ù¢Ù£                                     53
                                         ...
<img src=x onerror=alert('hi') />          31
/dev/null; touch /tmp/blns.fail ; echo     30
âªâªtestâª                                 29
ì¸ëë°í ë¥´                                 27
,ãã»:*:ã»ãâ( â» Ï â» )ãã»:*:ã»ãâ           25
Name: default, Length: 90, dtype: int64

In [66]:
CustomerDemographic=CustomerDemographic.drop('default', axis=1)

In [67]:
CustomerDemographic.head(5)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,720,Darrel,Canet,Male,67,1931-10-23,Recruiting Manager,Retail,Affluent Customer,N,No,6.0
1,1092,Katlin,Creddon,Female,56,1935-08-22,VP Quality Control,Retail,Mass Customer,N,No,5.0
2,3410,Merrili,Brittin,Female,93,1940-09-22,NaN,Property,Mass Customer,N,No,16.0
3,2413,Abbey,Murrow,Male,27,1943-08-11,Environmental Specialist,Manufacturing,High Net Worth,N,Yes,17.0
4,658,Donn,Bonnell,Male,38,1944-01-24,Tax Accountant,Manufacturing,Affluent Customer,N,Yes,8.0

In [68]:
CustomerDemographic['owns_car'].value_counts()

Yes    2024
No     1976
Name: owns_car, dtype: int64

In [69]:
CustomerDemographic['tenure'].value_counts()

7.0     235
5.0     228
11.0    221
10.0    218
16.0    215
8.0     211
18.0    208
12.0    202
9.0     200
14.0    200
6.0     192
13.0    191
4.0     191
17.0    182
15.0    179
1.0     166
3.0     160
19.0    159
2.0     150
20.0     96
22.0     55
21.0     54
Name: tenure, dtype: int64

So here Our Customer Demographic Dataset data quality Examine is Over . Now we Move towards the next dataset.

### CustomerAddress Dataset

In [70]:
CustomerAddress.head(5)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [71]:
CustomerAddress.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [72]:
CustomerAddress.describe

<bound method NDFrame.describe of       customer_id                    address  postcode            state  \
0               1         060 Morning Avenue      2016  New South Wales
1               2        6 Meadow Vale Court      2153  New South Wales
2               4         0 Holy Cross Court      4211              QLD
3               5        17979 Del Mar Point      2448  New South Wales
4               6           9 Oakridge Court      3216              VIC
...           ...                        ...       ...              ...
3994         3999            1482 Hauk Trail      3064              VIC
3995         4000  57042 Village Green Point      4511              QLD
3996         4001     87 Crescent Oaks Alley      2756              NSW
3997         4002           8194 Lien Street      4032              QLD
3998         4003            320 Acker Drive      2251              NSW

        country  property_valuation
0     Australia                  10
1     Australia                  10
2     Australia                   9
3     Australia                   4
4     Australia                   9
...         ...                 ...
3994  Australia                   3
3995  Australia                   6
3996  Australia                  10
3997  Australia                   7
3998  Australia                   7

[3999 rows x 6 columns]>

In [73]:
CustomerAddress.shape

(3999, 6)

In [74]:
CustomerAddress.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [75]:
CustomerAddress.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

In [76]:
CustomerAddress.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In that table 0 null value

In [77]:
CustomerAddress.duplicated().sum()

0

There is no duplicate value present in this data

Exploring the column

In [78]:
CustomerAddress.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [79]:
CustomerAddress['postcode'].value_counts()

2170    31
2155    30
2145    30
2153    29
3977    26
        ..
3808     1
3114     1
4721     1
4799     1
3089     1
Name: postcode, Length: 873, dtype: int64

In [80]:
CustomerAddress['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [81]:
CustomerAddress['country'].value_counts()

Australia    3999
Name: country, dtype: int64

In [82]:
CustomerAddress['property_valuation'].value_counts()

9     647
8     646
10    577
7     493
11    281
6     238
5     225
4     214
12    195
3     186
1     154
2     143
Name: property_valuation, dtype: int64

So here finally our examine of All dataset are over now, and all our dataset  having correct information.